# Panda Series

In [1]:
import pandas as pd
import numpy as np

data = [10,20,30,40,50]
series = pd.Series(data)
print(series)

print(series.sum)

print("less than 20", series[series < 20])
print(series)

series1 = pd.Series(data, index=['a','b','c','d','e'])
print(series1)

data_dict = {'apple': 3, 'banana': 5, 'cherry': 7}
series = pd.Series(data_dict)
print(series)

series2 = pd.Series(10, index=['a', 'b', 'c'])
print(series2)

print(series2['b'])
print(series2[1])

0    10
1    20
2    30
3    40
4    50
dtype: int64
<bound method Series.sum of 0    10
1    20
2    30
3    40
4    50
dtype: int64>
less than 20 0    10
dtype: int64
0    10
1    20
2    30
3    40
4    50
dtype: int64
a    10
b    20
c    30
d    40
e    50
dtype: int64
apple     3
banana    5
cherry    7
dtype: int64
a    10
b    10
c    10
dtype: int64
10
10

# Data Frame

In [2]:
# DataFrame using Dictionary
data = {
    'Name': ['Alice', 'Bob', 'Cahrlie'],
    'Age': [25,30,35],
    'City': ['New York', 'Los Angleles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)


data1 = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angleles'},
    {'Name': 'Cahrlie', 'Age': 35, 'City': 'Chicago'}
]
df1 = pd.DataFrame(data1)
print(df1)


# DataFrame using List
names = ['Alice', 'Bob', 'Cahrlie']
ages = [25,30,35]
cities = ['New York', 'Los Angleles', 'Chicago']
    
df2 = pd.DataFrame({'Name': names,
                  'Age': ages,
                  'City': cities})
print(df2)



# creating DataFrame from numpy array
array = np.array([[25,'New york'], [30,'Los Angeles'], [35, 'Chicago']])
df4 = pd.DataFrame(array, columns=['Age','City'])
print(df4)

#Raeding a Dataframe from series
df5 = pd.read_csv('dataDemo2.csv')
df5.info()

      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago
      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago
      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago
  Age         City
0  25     New york
1  30  Los Angeles
2  35      Chicago
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0      Roll No     Name Class  Marks  10 non-null     object
dtypes: object(1)
memory usage: 208.0+ bytes

In [3]:
# creating a dataframe from series

names = pd.Series(['Alice', 'Bob', 'Charlie'], name='Name')
ages = pd.Series([25,30,35])
df6 = pd.concat([names, ages], axis=1)
print(df6)

      Name   0
0    Alice  25
1      Bob  30
2  Charlie  35

# Assignment 1 - Readng CSV file

In [4]:
#Raeding a Dataframe from series
df5 = pd.read_csv('dataDemo2.csv')
df5
# df5.info()

     Roll No     Name Class  Marks
0          1    Alice  10th     85
1          2      Bob  10th     90
2          3  Charlie  11th     78
3          4    David  12th     92
4          5      Eva  10th     88
5          6    Frank  11th     76
6          7    Grace  12th     95
7          8   Hannah  10th     89
8          9      Ian  11th     84
9         10     Jack  12th     91

In [5]:
# head df.head- first 5 rows
#tail df.tail- last 5 rows
#info df.info()
#describe 


df5 = pd.read_csv('dataDemo2.csv')
# df5.info()
type(df5)

pandas.core.frame.DataFrame

In [6]:
df5.head()

     Roll No     Name Class  Marks
0          1    Alice  10th     85
1          2      Bob  10th     90
2          3  Charlie  11th     78
3          4    David  12th     92
4          5      Eva  10th     88

In [7]:
df5.tail()

     Roll No     Name Class  Marks
5          6    Frank  11th     76
6          7    Grace  12th     95
7          8   Hannah  10th     89
8          9      Ian  11th     84
9         10     Jack  12th     91

In [8]:
df5.describe()

          Roll No     Name Class  Marks
count                                10
unique                               10
top             6    Frank  11th     76
freq                                  1

# Quartile

In [9]:
data = {'Values': [10,12,16,45,25,68,63,14,25,86,455]}
df = pd.DataFrame(data)

q1 = df['Values'].quantile(0.25)
q3 = df['Values'].quantile(0.75)
iqr = q3 - q1

lower_bound = q1 - 1.5 * iqr
upper_bound = q3 + 1.5 * iqr

outliers = df[(df['Values'] < lower_bound) | (df['Values'] > upper_bound)]
print("outliers:\n",outliers)

outliers:
     Values
10     455

# Ranking

In [31]:
#creating a series
data = pd.Series([12,12,35,35,41,58,56,56,65,95])

#ranking with different method
print("Average rank:")
print(data.rank(method='average'))

Average rank:
0     1.5
1     1.5
2     3.5
3     3.5
4     5.0
5     8.0
6     6.5
7     6.5
8     9.0
9    10.0
dtype: float64

In [32]:
print("Min rank:")
print(data.rank(method='min'))

Min rank:
0     1.0
1     1.0
2     3.0
3     3.0
4     5.0
5     8.0
6     6.0
7     6.0
8     9.0
9    10.0
dtype: float64

In [33]:
print("Max rank:")
print(data.rank(method='max'))

Max rank:
0     2.0
1     2.0
2     4.0
3     4.0
4     5.0
5     8.0
6     7.0
7     7.0
8     9.0
9    10.0
dtype: float64

In [34]:
print("First rank:")
print(data.rank(method='first'))

First rank:
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     8.0
6     6.0
7     7.0
8     9.0
9    10.0
dtype: float64

In [35]:
print("Dense rank:")
print(data.rank(method='dense'))

Dense rank:
0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
5    5.0
6    4.0
7    4.0
8    6.0
9    7.0
dtype: float64

# Data Selection

In [42]:
data = {
    'Name': ['Alice', 'Bob', 'Cahrlie'],
    'Age': [25,30,35],
    'City': ['New York', 'Los Angleles', 'Chicago']
}
df10 = pd.DataFrame(data)
df10

      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago

In [45]:
#index location
df10.iloc[1]

Name             Bob
Age               30
City    Los Angleles
Name: 1, dtype: object

In [47]:
# row access
df10.loc[1]

Name             Bob
Age               30
City    Los Angleles
Name: 1, dtype: object

In [48]:
df10.loc[1:]

      Name  Age          City
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago

In [51]:
df10.loc[1:2,['Name','City']]

      Name          City
1      Bob  Los Angleles
2  Cahrlie       Chicago

In [53]:
df10.loc[df10['Age'] > 25]

      Name  Age          City
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago

In [100]:
df10.loc[(df10['City'].isin['Chicago'])]

TypeError: 'method' object is not subscriptable

# Assignment 2

In [61]:
df = pd.read_csv('iris.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [63]:
df.loc[1:10,['sepal_length','sepal_width','species']]

    sepal_length  sepal_width species
1            4.9          3.0  setosa
2            4.7          3.2  setosa
3            4.6          3.1  setosa
4            5.0          3.6  setosa
5            5.4          3.9  setosa
6            4.6          3.4  setosa
7            5.0          3.4  setosa
8            4.4          2.9  setosa
9            4.9          3.1  setosa
10           5.4          3.7  setosa

In [96]:
df.loc[(df['sepal_length'] < 5) & (df['sepal_width'] > 3)].head()
# df10.loc[df10['Age'] > 25]

    sepal_length  sepal_width  petal_length  petal_width species
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
6            4.6          3.4           1.4          0.3  setosa
9            4.9          3.1           1.5          0.1  setosa
11           4.8          3.4           1.6          0.2  setosa

In [97]:
df.iloc[1:6,1:4]

   sepal_width  petal_length  petal_width
1          3.0           1.4          0.2
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

In [105]:
df.loc[(df['sepal_length'] == 4.9) | (df['petal_length'] == 1.5)].head()

    sepal_length  sepal_width  petal_length  petal_width species
1            4.9          3.0           1.4          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
7            5.0          3.4           1.5          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa

# Data Manupulation

In [107]:
data = {
    'Name': ['Alice', 'Bob', 'Cahrlie','lie', 'kob', 'Care'],
    'Age': [25,30,35,65,85,31],
    'City': ['New York', 'Los Angleles', 'Chicago','Nork', 'Loss', 'hicao']
}
dfr = pd.DataFrame(data)
dfr

      Name  Age          City
0    Alice   25      New York
1      Bob   30  Los Angleles
2  Cahrlie   35       Chicago
3      lie   65          Nork
4      kob   85          Loss
5     Care   31         hicao